; domain
(define (domain recovery-blocks)
  (:requirements :strips :typing :equality)
  (:types block surface)

  (:predicates
    (On ?x - block ?y - block)
    (OnTable ?x - block)
    (Clear ?x - block)
    (Holding ?x - block)
    (HandEmpty)
    (TargetOn ?x - block ?y - block)
    (AtTarget ?x - block)
  )

  (:action pickup-from-table
    :parameters (?x - block)
    :precondition (and (HandEmpty) (OnTable ?x) (Clear ?x))
    :effect (and (Holding ?x)
                 (not (OnTable ?x))
                 (not (HandEmpty))
                 (not (AtTarget ?x)))
  )

  (:action putdown-to-table
    :parameters (?x - block)
    :precondition (Holding ?x)
    :effect (and (OnTable ?x) (Clear ?x) (HandEmpty)
                 (not (Holding ?x))
                 (not (AtTarget ?x)))
  )

  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and (HandEmpty) (On ?x ?y) (Clear ?x) (not (= ?x ?y)))
    :effect (and (Holding ?x) (Clear ?y)
                 (not (On ?x ?y)) (not (HandEmpty))
                 (not (AtTarget ?x)))
  )

  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and (Holding ?x) (Clear ?y) (not (= ?x ?y)))
    :effect (and (On ?x ?y) (Clear ?x) (HandEmpty)
                 (not (Holding ?x)) (not (Clear ?y))
                 (not (AtTarget ?x)))
  )

  (:action stack-target
    :parameters (?x - block ?y - block)
    :precondition (and (Holding ?x) (Clear ?y) (TargetOn ?x ?y) (not (= ?x ?y)))
    :effect (and (On ?x ?y) (Clear ?x) (HandEmpty)
                 (not (Holding ?x)) (not (Clear ?y))
                 (AtTarget ?x))
  )
)

; problem
(define (problem recovery-problem)
  (:domain recovery-blocks)
  (:objects
    A B C D - block
  )
  (:init
    (HandEmpty)
    (On B A)
    (On C B)
    (On D C)
    (OnTable A)
    (OnTable TABLE)
    (Clear D)
    (Clear TABLE)
    (TargetOn B A)
    (TargetOn C B)
    (TargetOn D C)
  )
  (:goal (and
    (AtTarget B)
    (AtTarget C)
    (AtTarget D)
    (On B A)
    (On C B)
    (On D C)
    (OnTable A)
    (OnTable TABLE)
    (HandEmpty)
  ))
)

; plan
1. (unstack d c)
   deleted: (on d c) (handempty)
   added: (holding d) (clear c)
   goals met: 4 of 9
2. (putdown-to-table d)
   deleted: (holding d)
   added: (ontable d) (handempty)
   goals met: 5 of 9
3. (unstack c b)
   deleted: (on c b) (handempty)
   added: (holding c) (clear b)
   goals met: 3 of 9
4. (stack c d)
   deleted: (holding c) (clear d)
   added: (on c d) (handempty)
   goals met: 4 of 9
5. (unstack b a)
   deleted: (on b a) (handempty)
   added: (holding b) (clear a)
   goals met: 2 of 9
6. (stack-target b a)
   deleted: (holding b) (clear a)
   added: (on b a) (handempty) (attarget b)
   goals met: 5 of 9
7. (unstack c d)
   deleted: (on c d) (handempty)
   added: (holding c) (clear d)
   goals met: 4 of 9
8. (stack-target c b)
   deleted: (holding c) (clear b)
   added: (on c b) (handempty) (attarget c)
   goals met: 7 of 9
9. (pickup-from-table d)
   deleted: (ontable d) (handempty)
   added: (holding d)
   goals met: 6 of 9
10. (stack-target d c)
   deleted: (holding d) (clear c)
   added: (on d c) (handempty) (attarget d)
   goals met: 9 of 9
